Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview of the role of witnesses in court cases in Ireland
ga: Tá cur síos sa cháipéis seo ar ról finnéithe i gcásanna cúirte in Éirinn

source: Different types of witnesses that can be encountered in a court of law in Ireland
ga: Tá cur síos sa cháipéis seo ar na cineálacha finnéithe gur féidir a fháil i gcúirt dlí in Éirinn

source: Who can be forced to be a witness?
ga: Cé na daoine gur féidir iallach a chur orthu a bheith ina bhfinnéithe?

source: This document describes situations when a person can be compelled (forced) to give evidence in a court of law
ga: Tá cur síos sa cháipéis seo ar na cúinsí inár féidir iallach a chur ar dhaoine fianaise a thabhairt i gcúirt dlí

source: Witnesses under 18 years
ga: Finnéithe faoi 18 mbliana

source: Rules under which witnesses under 18 years may give evidence in the District Court, the Circuit Court or the Central Criminal Court
ga: Tá cur síos anseo ar na rialacha a bhaineann le finnéithe faoi 18 mbliana déag a thugann fianaise sa Chúirt Dúiche, Chuarda nó sa Chúirt Choiriúil Lárnach

source: How you are called as a witness
ga: An chaoi a nglaotar ar dhuine le bheith ina f(h)inné

source: This document describes the procedure for calling a person as a witness in a court case and explains entitlement to witness expenses
ga: Tá cur síos sa cháipéis seo ar an mbealach ina nglaotar ar dhuine le bheith ina f(h)inné

source: The procedure for being a witness
ga: An modh le bheith i d'fhinné

source: Steps involved in giving evidence as a witness in a court of law in Ireland
ga: Tá cur síos anseo ar a bhfuil i gceist le fianaise a thabhairt i gcúirt dlí in Éirinn

source: Rules relating to your evidence
ga: Rialacha a bhaineann le d'fhianaise

source: There are specific rules in place that govern the giving of evidence by witnesses in a court of law
ga: Tá cur síos anseo ar na rialacha faoi leith atá i bhfeidhm maidir le fianaise a thugann finnéithe sa chúirt

source: Giving evidence by television-link
ga: Fianaise a thabhairt le nasc teilifíse

source: Recent legislation in Ireland has introduced the concept of video-link evidence in cases
ga: Tá reachtaíocht tugtha isteach le deireanas in Éirinn a thugann cead fianaise a thabhairt le nasc-físe i gcás cúirte

source: This document discusses situations when witnesses in a court case are permitted to give their evidence via television-link
ga: Tá cur síos sa cháipéis seo ar na hamanna inár féidir le finné i gcás cúirte fianaise a thabhairt tríd nasc teilifíse

source: An afffidavit is a sworn written statement that sets out the evidence that a witness wishes to give in court in Ireland
ga: Ráiteas scríofa faoi mhionn is ea an mionnscríbhinn a leagann amach an fhianaise ar mhian le finné a thabhairt sa chúirt

source: Admissibility of certain witness statements in a criminal trial
ga: Inghlacthacht ráiteas finné áirithe i dtriail choiriúil

source: What happens if a witness refuses to give evidence in a criminal trial?
ga: Cad a tharlaíonn má dhiúltaíonn finné fianaise a thabhairt i dtriail coiriúil?

source: This law on this area is covered by the Criminal Justice Act 2006
ga: Clúdaíonn an tAcht um Cheartas Coiriúil an dlí sa réimse seo

source: A hostile witness is a witness who appears unwilling to tell the truth
ga: Is éard is finné naimhdeach ann ná finné a bhfuil an cuma air/uirthi nach bhfuil sé/sí toilteanach an fhírinne a insint

source: Find out how a hostile witness is treated in court here
ga: Faigh amach anseo conas a chaitear le finné naimhdeach sa chúirt

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
